app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM `orders`

  def cancel_order
    order = Order.find params[:order_id]
    order.status = Order::CANCELLED
    order.save
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 6)
UPDATE `orders` SET `updated_at` = '2009-04-22 14:09:19', `status` = 3 WHERE `id` = 6