app/controllers/admin/users_controller.rb

SELECT * FROM `skins` WHERE (`skins`.`user_id` = '2') LIMIT 1
---
  def skins
    @skins = Skin.find_all_by_user_id params[:user_id]