app/controllers/images_controller.rb

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def show
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 1)
---
  def edit
    @image = Image.find(params[:id])

SELECT * FROM `images` WHERE (`images`.`id` = 1)
UPDATE `images` SET `name` = 'test image blala' WHERE `id` = 1
---
  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])