app/controllers/site_controller.rb

  def users
    @user = User.find_by_login params[:user_name]
    if @user==nil then redirect_to_index('invalid user');end
    # show all the users public skins
    @skins = Skin.find_all_by_user_id @user, :conditions => 'public =1'
---
SELECT * FROM `users` WHERE (`users`.`login` = 'love') LIMIT 1
SELECT * FROM `skins` WHERE (public =1) AND (`skins`.`user_id` = 2)

  def add_to_cart
    begin
      item = Skin.find(params[:id])
---
SELECT * FROM `skins` WHERE (`skins`.`id` = 1)

  def remove_item
    item = Skin.find(params[:id])
---
SELECT * FROM `skins` WHERE (`skins`.`id` = 1)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    @order.status  = Order::NEW
    @address = Address.new(params[:address])
    @user = User.new(params[:user])
    @user.email = @order.email
    @user.save

    Order.transaction do
      @address.save!
      @order.address = @address
      @order.save!
---
INSERT INTO `orders` (`created_at`, `updated_at`, `pay_type`, `address_id`, `status`, `email`) VALUES('2009-04-21 15:01:50', '2009-04-21 15:01:50', 'transfer', 1, 0, 'liam@test.one')
INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('5cbf11906db8226858ba85e37a95a755ceae6e3d', '2009-04-22 14:07:24', NULL, '28c6c78705ed6afa34eca0bce56b109bf758da61', NULL, '2009-04-22 14:07:24', 'ab98ef9ac1fc0b143155d48273e1be5667649b54', NULL, 'love', 'love@craft.com')
INSERT INTO `addresses` (`postcode`, `country_code`, `address_1`, `last_name`, `address_2`, `town`, `first_name`) VALUES('', 'Bangladesh', 'foo street', 'sl', '', 'stamford', 'sami')
INSERT INTO `line_items` (`name`, `skin_id`, `quantity`, `order_id`, `total_price`, `unit_postage`, `unit_price`) VALUES(NULL, 1, 1, 8, 2.0, 1, 1)