app/controllers/skins_controller.rb

SELECT * FROM `skins` WHERE (`skins`.`id` = 2)
---
  def show
    @skin = Skin.find(params[:id])

SELECT * FROM `skins` WHERE (`skins`.`id` = 2)
---
  def edit
    @skin = Skin.find(params[:id])

INSERT INTO `skins` (`price`, `name`, `public`, `user_id`, `height`, `width`, `active`) VALUES(1.0, 'liam\'s first skin', 1, NULL, 500, 200, 1)
INSERT INTO `images` (`name`, `skin_id`) VALUES(NULL, 3)
---
  def create
    @skin = Skin.new(params[:skin])
    #set the price
    @skin.price=1
    @image = Image.new(params[:image])
    Skin.transaction do
      @image.skin=@skin
      @skin.save!
      @image.save!

SELECT * FROM `skins` WHERE (`skins`.`id` = 2)
UPDATE `skins` SET `name` = 'lovecraft skin', `public` = 0 WHERE `id` = 1
---
  def update
    @skin = Skin.find(params[:id])

    respond_to do |format|
      if @skin.update_attributes(params[:skin])