app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('c7a1d81b14a00c20224aa14659ac9c60ab9de1d3', '2009-04-16 08:12:04', NULL, 'adcb2dd55798a9df92f80cdcb79969bec43160db', NULL, '2009-04-16 08:12:04', 'addc99f3c7efd9f0642d5055c34ba5716c85ff82', NULL, 'sami', 'sami@foo.com')

  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = 'addc99f3c7efd9f0642d5055c34ba5716c85ff82') LIMIT 1